extends Resource

class_name ArenaZonePlacementData


# ============================================================
# ТИПЫ ЗОН
# ============================================================

enum Zone {
	PLAYER_1_DEPLOYMENT,
	PLAYER_1_MAIN,
	NEUTRAL,
	PLAYER_2_MAIN,
	PLAYER_2_DEPLOYMENT,
	NONE
}


# ============================================================
# КООРДИНАТЫ
# ============================================================

@export var x: int = 0

@export var y: int = 0


# ============================================================
# ЛОГИЧЕСКАЯ ЗОНА
# ============================================================

@export var zone: Zone = Zone.NEUTRAL
